RenePlattnerCS/stm32F-_Turorials_but_I_do_it_on_stm32C-/11 _InterruptTest/Src/timer.c
#include "stm32C0xx.h"


#define TIM1EN			(1U << 11)
#define TIM3EN			(1U << 1)

#define CR1_CEN			(1U << 0)

#define OC_TOGGLE			(1U<<4) | (1U<<5)
#define CCER_OC_CC1E		(1U<<0)

#define GPIOAEN		(1U<<0)

#define PIN5		(1U<<5)

#define AFR5_TIM1_CH1		(1U<<22) | (1U<<20)
#define AFR6_TIM3_CH1		(1U<<24)

#define CCER_CC1S_TIM3			(1U<<0)

void tim1_1hz_init(void)
{
	//enable clock to timer 1
	RCC->APBENR2 |= TIM1EN;
	//set prescaler
	TIM1->PSC = 1600 - 1;

	// set auto reaload
	TIM1->ARR = 10000 -1;

	//clear counter
	TIM1->CNT = 0;
	//enable timer


	TIM1->CR1 = CR1_CEN;

}


void tim1_output_compare(void)
{

	RCC->IOPENR |= GPIOAEN;
	//PA5 to AF moder
	GPIOA->MODER &= ~(1U << 10);
	GPIOA->MODER |= (1U << 11);



	//set PA5 to alternate function mode 5
	GPIOA->AFR[0] |= AFR5_TIM1_CH1;

	//enable clock to timer 1
	RCC->APBENR2 |= TIM1EN;

	//set prescaler
	TIM1->PSC = 1600 - 1;


	// set auto reaload
	TIM1->ARR = 10000 -1;


	//set output compare to toggle mode
	TIM1->CCMR1 = OC_TOGGLE;


	//enable tim1 ch1 in compare mode
	TIM1->CCER |= CCER_OC_CC1E;




	//clear counter
	TIM1->CNT = 0;


	TIM1->CR1 = CR1_CEN;
	// main output enable (needed for TIM1 advanced timer)
	TIM1->BDTR |= TIM_BDTR_MOE;

}



void tim3_pa6_input_capture(void)
{

	RCC->IOPENR |= GPIOAEN;
	//PA6 to AF moder
	GPIOA->MODER &= ~(1U << 12);
	GPIOA->MODER |= (1U << 13);



	//set PA6 to alternate function mode 1
	GPIOA->AFR[0] |= AFR6_TIM3_CH1;

	//enable clock to timer 3
	RCC->APBENR1 |= TIM3EN;

	//set prescaler
	TIM1->PSC = 1600 - 1;

	//set CH1 to capture on every  edge (input mode)
	TIM3->CCMR1 = CCER_CC1S_TIM3;
	//set CH1 to capture on rising edge
	TIM3->CCER |= CCER_CC1S_TIM3;


	//enable timer 3
	TIM3->CR1 = CR1_CEN;
	// main output enable (needed for TIM1 advanced timer)
	//TIM1->BDTR |= TIM_BDTR_MOE;

}
